In [1]:
# creating an empty dataframe
import pandas as pd
df_empty = pd.DataFrame()
df_empty

Empty DataFrame
Columns: []
Index: []

In [2]:
print(df_empty.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame
None

Creating dataframes

In [3]:
#1. Creating a dataframe from lists
import pandas as pd
data = [10, 20, 30, 40, 50]
df1 = pd.DataFrame(data=data, columns=['Numbers'])
df1

   Numbers
0       10
1       20
2       30
3       40
4       50

In [4]:
# 2. Creating a dataframe from a dictionary
import pandas as pd
data = {'Name':['John', 'Tim', 'Rob'], 'Age':[34, 23, 42]}
df = pd.DataFrame(data=data)
df

   Name  Age
0  John   34
1   Tim   23
2   Rob   42

Dataframe and its associated methods
1) df.info()
2) df.describe()
3) df.sample()
4) df.head()
5) df.tail()
6) df.size
7) df.shape
8) df.dtypes
9) df.memory_usage()
10) df.rename()
11) df.loc()
12) df.insert()
13) df.assign()

In [5]:
# Creating a standard dataframe with all datatypes 
import pandas as pd
import numpy as np

data = {
    'Employee_ID': [101, 102, 103, 104, 105],
    'First_Name': ['John', 'Alice', 'Bob', 'Eva', 'Silvester'],
    'Last_Name': ['Smith', 'Johnson', 'Brown', 'Davis', 'Smith'],
    'Birth_Date': ['1990-05-15', '1995-03-20', '1985-09-10', '1992-11-25', '1970-04-23'],
    'Hire_Date': pd.to_datetime(['2020-07-01', '2018-04-15', '2015-10-03', '2019-02-12', '2012-06-07']),
    'Salary': [55000.0, 60000.5, 48000.75, 62000.25, 1640000.0],
    'Active': ["Y", " ", "N", "Y", "N"],
    'Department': ['HR', 'Engineering', 'Finance', 'Marketing', 'HR']
}

df = pd.DataFrame(data)
df.head()

,Employee_ID,First_Name,Last_Name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
1,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,,Engineering
2,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,N,Finance
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing
4,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,N,HR

In [6]:
# to show random rows from a dataframe
df.sample(4)

,Employee_ID,First_Name,Last_Name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
2,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,N,Finance
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing
4,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,N,HR

In [7]:
# to show the rows from last 5 rows of a dataframe
df.tail()

,Employee_ID,First_Name,Last_Name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
1,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,,Engineering
2,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,N,Finance
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing
4,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,N,HR

In [8]:
# size of a dataframe - rows * columns
print(df.size)

40

In [9]:
# shape of a dataframe - no of rows and columns
print(df.shape)

(5, 8)

In [10]:
print(df.dtypes)

Employee_ID             int64
First_Name             object
Last_Name              object
Birth_Date             object
Hire_Date      datetime64[ns]
Salary                float64
Active                 object
Department             object
dtype: object

In [11]:
# to return the memory usasge of a dataframe for each column in bytes
df.memory_usage()

Index          132
Employee_ID     40
First_Name      40
Last_Name       40
Birth_Date      40
Hire_Date       40
Salary          40
Active          40
Department      40
dtype: int64

In [12]:
# to get a concise summary of a dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Employee_ID  5 non-null      int64
 1   First_Name   5 non-null      object
 2   Last_Name    5 non-null      object
 3   Birth_Date   5 non-null      object
 4   Hire_Date    5 non-null      datetime64[ns]
 5   Salary       5 non-null      float64
 6   Active       5 non-null      object
 7   Department   5 non-null      object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 452.0+ bytes

In [13]:
df.describe()

       Employee_ID            Hire_Date        Salary
count     5.000000                    5  5.000000e+00
mean    103.000000  2017-03-20 14:24:00  3.730003e+05
min     101.000000  2012-06-07 00:00:00  4.800075e+04
25%     102.000000  2015-10-03 00:00:00  5.500000e+04
50%     103.000000  2018-04-15 00:00:00  6.000050e+04
75%     104.000000  2019-02-12 00:00:00  6.200025e+04
max     105.000000  2020-07-01 00:00:00  1.640000e+06
std       1.581139                  NaN  7.082950e+05

In [14]:
for index, value in df.iterrows():
    print(index, value)

0 Employee_ID                    101
First_Name                    John
Last_Name                    Smith
Birth_Date              1990-05-15
Hire_Date      2020-07-01 00:00:00
Salary                     55000.0
Active                           Y
Department                      HR
Name: 0, dtype: object
1 Employee_ID                    102
First_Name                   Alice
Last_Name                  Johnson
Birth_Date              1995-03-20
Hire_Date      2018-04-15 00:00:00
Salary                     60000.5
Active
Department             Engineering
Name: 1, dtype: object
2 Employee_ID                    103
First_Name                     Bob
Last_Name                    Brown
Birth_Date              1985-09-10
Hire_Date      2015-10-03 00:00:00
Salary                    48000.75
Active                           N
Department                 Finance
Name: 2, dtype: object
3 Employee_ID                    104
First_Name                     Eva
Last_Name                    Davis
Birth_Date              1992-11-25
Hire_Date      2019-02-12 00:00:00
Salary                    62000.25
Active                           Y
Department               Marketing
Name: 3, dtype: object
4 Employee_ID                    105
First_Name               Silvester
Last_Name                    Smith
Birth_Date              1970-04-23
Hire_Date      2012-06-07 00:00:00
Salary                   1640000.0
Active                           N
Department                      HR
Name: 4, dtype: object

In [15]:
# how to rename columns of dataframe
df.head()

,Employee_ID,First_Name,Last_Name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
1,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,,Engineering
2,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,N,Finance
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing
4,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,N,HR

In [16]:
# to rename columns in a datafrane
col_names = {
                "Employee_ID": "emp_id",
                "First_Name" : "first_name",
                "Last_Name" : "last_name" 
            }

df.rename(columns=col_names, inplace=True) # inplace = True -> means changes should happen directly to original dataframe
df.head()

,emp_id,first_name,last_name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
1,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,,Engineering
2,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,N,Finance
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing
4,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,N,HR

In [17]:
# to get tha column - Department == 'HR' or check if column - Department == 'Finance' 

df_HR_Finance = df[
    (df['Department'] == 'HR') 
    | 
    (df['Department'] == 'Finance')
  ]
df_HR_Finance

,emp_id,first_name,last_name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
2,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,N,Finance
4,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,N,HR

In [18]:
# to check if a column in dataframe has certain value or not
# check if Employee_ID column has

In [26]:
# filter df for Active - "Y" OR Active = SPACES 
df[(df["Active"] == "Y") | (df["Active"] == " ")]

,emp_id,first_name,last_name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
1,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,,Engineering
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing

In [32]:
# filter df for Active - "Y" OR Active = SPACES 
import numpy as np
NULL = np.nan
space_conditions = [" ", "N/A", "NULL", None, "", "None", NULL]
df[(df["Active"] == "Y") | (df["Active"].isin(space_conditions))]

,emp_id,first_name,last_name,Birth_Date,Hire_Date,Salary,Active,Department
0,101,John,Smith,1990-05-15,2020-07-01,55000.00,Y,HR
1,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,,Engineering
3,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,Y,Marketing

In [19]:
import pandas as pd

# Create a sample DataFrame
data = {'Name': ['John', 'Alice', 'Bob'],
        'Age': [30, 25, 35]}
df1 = pd.DataFrame(data)
df1

    Name  Age
0   John   30
1  Alice   25
2    Bob   35

In [20]:
# Iterate through rows using a for loop
for index in range(len(df)):
    row = df.loc[index]
    print(row)

emp_id                        101
first_name                   John
last_name                   Smith
Birth_Date             1990-05-15
Hire_Date     2020-07-01 00:00:00
Salary                    55000.0
Active                          Y
Department                     HR
Name: 0, dtype: object
emp_id                        102
first_name                  Alice
last_name                 Johnson
Birth_Date             1995-03-20
Hire_Date     2018-04-15 00:00:00
Salary                    60000.5
Active
Department            Engineering
Name: 1, dtype: object
emp_id                        103
first_name                    Bob
last_name                   Brown
Birth_Date             1985-09-10
Hire_Date     2015-10-03 00:00:00
Salary                   48000.75
Active                          N
Department                Finance
Name: 2, dtype: object
emp_id                        104
first_name                    Eva
last_name                   Davis
Birth_Date             1992-11-25
Hire_Date     2019-02-12 00:00:00
Salary                   62000.25
Active                          Y
Department              Marketing
Name: 3, dtype: object
emp_id                        105
first_name              Silvester
last_name                   Smith
Birth_Date             1970-04-23
Hire_Date     2012-06-07 00:00:00
Salary                  1640000.0
Active                          N
Department                     HR
Name: 4, dtype: object

In [21]:
# Forward fill NaN values with method 'ffill' to fill the missing labels
# df.fillna()
df['Labels'] = df['Data'].fillna(method='ffill')

KeyError: 'Data'

In [ ]:
# Filter out rows with NaN values in the 'Data' column
# df.notna()
df = df[df['Data'].notna()]

# Pivot the DataFrame to reshape it
result_df = df.pivot(index='Labels', columns=None, values='Data').reset_index()

KeyError: None

In [ ]:
# Rename the columns
result_df.columns = ['Name', 'Contact', 'Address']

# Reset the index
result_df.reset_index(drop=True, inplace=True)

# Display the result
print(result_df)

In [ ]:
# ro add new column to a dataframe using 
# insert() method
# assign() method

df.insert(0, "policy", ["AA", "BB", "CC", "DD", "AA"], True)
df

,policy,Employee_ID,First_Name,Last_Name,Birth_Date,Hire_Date,Salary,Active,Department
0,AA,101,John,Smith,1990-05-15,2020-07-01,55000.00,True,HR
1,BB,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,True,Engineering
2,CC,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,False,Finance
3,DD,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,True,Marketing
4,AA,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,False,HR

In [ ]:
# assigm
df2 = df.assign(Address = ["Delhi", "Bangalore", "Gurgoan", "Noida", "Patna"])
df2

,policy,Employee_ID,First_Name,Last_Name,Birth_Date,Hire_Date,Salary,Active,Department,Address
0,AA,101,John,Smith,1990-05-15,2020-07-01,55000.00,True,HR,Delhi
1,BB,102,Alice,Johnson,1995-03-20,2018-04-15,60000.50,True,Engineering,Bangalore
2,CC,103,Bob,Brown,1985-09-10,2015-10-03,48000.75,False,Finance,Gurgoan
3,DD,104,Eva,Davis,1992-11-25,2019-02-12,62000.25,True,Marketing,Noida
4,AA,105,Silvester,Smith,1970-04-23,2012-06-07,1640000.00,False,HR,Patna

In [ ]:
df_random = df['Employee_ID'].sample(2)
df_random

0    101
1    102
Name: Employee_ID, dtype: int64

In [ ]:
df1

    Name  Age
0   John   30
1  Alice   25
2    Bob   35

In [ ]:
df1.insert(2, df_random, True)
df1

TypeError: unhashable type: 'Series'